# diceTerm 

A terminal tool for dungeon masters who are tired of rolling dice in the physical realm. 

Example of use:

```
> d20
20
> 3d6
result of 3d6 : [3, 5, 6]
Total : 14
> 4d12
result of 4d12 : [3, 6, 5, 10]
Total : 24
> d100
48
> exit
```

Use the up and down arrow keys to cycle through the prompt history of the current
session. 

Requires prompt\_toolkit. 

Install prompt toolkit: 

```
pip install prompt_toolkit
```
